app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def my_blogs
    @blogs = Blog.all

INSERT INTO "blogs" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "text"], ["content", nil], ["created_at", "2022-08-24 09:34:29.965760"], ["updated_at", "2022-08-24 09:34:29.965760"], ["user_id", 6]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "updated_at" = $1 WHERE "blogs"."id" = $2  [["updated_at", "2022-08-24 06:13:54.941345"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)