app/controllers/welcome_controller.rb

  def index
    @blogs = Blog.published.last(5)
---
SELECT "blogs".* FROM "blogs" ORDER BY "blogs"."id" DESC LIMIT $1  [["LIMIT", 5]]